In [63]:
import pandas as pd
import numpy as np

In [69]:
transactions_result = pd.read_csv('data/transactions_result.csv')
transactions_result

              acct_nbr  tran_amt  avg_tran_amt
0             13624802        96     99.535208
1             13624803        26    128.769231
2             13624842        99     77.955758
3             13624843        33    120.860606
4             13624852        99    103.074444
...                ...       ...           ...
1388  4561143213634830        74    140.094459
1389  4561143213634840        39    176.143590
1390  4561143213634850        22     67.272727
1391  4561143213634860        38      0.000000
1392  4561143213634920        25    502.100400

[1393 rows x 3 columns]

In [81]:
# Read the checking_result data
checking_tran = pd.read_csv('data/checking_result.csv')
checking_tran['cust_id']=checking_tran['cust_id'].astype(int)
checking_tran.shape

(520, 3)

In [140]:
credit_tran = pd.read_csv('data/credit_result.csv')
credit_tran['cust_id']=credit_tran['cust_id'].astype(int)
credit_tran.shape

(452, 3)

In [142]:
join_checking_credit = pd.merge(checking_tran,credit_tran, on='cust_id',how='outer')
join_checking_credit

,cust_id,checking_tran_count,checking_tran_avg,credit_tran_count,credit_tran_avg
0,1362480,93.0,76.888710,31.0,191.106129
1,1362484,98.0,71.330918,55.0,182.569636
2,1362485,96.0,80.350625,72.0,175.404861
3,1362486,25.0,43.256000,NaN,NaN
4,1362487,52.0,62.400577,32.0,149.162813
...,...,...,...,...,...
598,1363459,NaN,NaN,29.0,131.087241
599,1363468,NaN,NaN,41.0,199.990732
600,1363482,NaN,NaN,52.0,183.445769
601,1363485,NaN,NaN,22.0,67.272727
602,1363486,NaN,NaN,38.0,0.000000

In [143]:
savings_result = pd.read_csv('data/savings_result.csv')
savings_result.head()

   cust_id  savings_tran_count  savings_tran_avg
0  1362480                  26        128.769231
1  1362484                  31         81.172581
2  1362486                  25         55.033600
3  1362487                  19         46.711579
4  1362489                  22         97.195909

In [144]:
join_checking_credit_saving=pd.merge(join_checking_credit,savings_result, on='cust_id',how='outer')

In [150]:
join_checking_credit_saving['no_of_accounts']=join_checking_credit_saving[['checking_tran_avg','credit_tran_avg','savings_tran_avg']].count(axis=1)

join_checking_credit_saving['no_of_trans']=join_checking_credit_saving[['checking_tran_count','credit_tran_count','savings_tran_count']].sum(axis=1)


join_checking_credit_saving['all_tran_avg']=round(join_checking_credit_saving[['checking_tran_avg','credit_tran_avg','savings_tran_avg']].mean(axis=1),2)
join_checking_credit_saving

,cust_id,checking_tran_count,checking_tran_avg,credit_tran_count,credit_tran_avg,savings_tran_count,savings_tran_avg,no_of_accounts,all_tran_avg,no_of_trans
0,1362480,93.0,76.888710,31.0,191.106129,26.0,128.769231,3,132.25,150.0
1,1362484,98.0,71.330918,55.0,182.569636,31.0,81.172581,3,111.69,184.0
2,1362485,96.0,80.350625,72.0,175.404861,NaN,NaN,2,127.88,168.0
3,1362486,25.0,43.256000,NaN,NaN,25.0,55.033600,2,49.14,50.0
4,1362487,52.0,62.400577,32.0,149.162813,19.0,46.711579,3,86.09,103.0
...,...,...,...,...,...,...,...,...,...,...
658,1363376,NaN,NaN,NaN,NaN,34.0,109.470588,1,109.47,34.0
659,1363445,NaN,NaN,NaN,NaN,31.0,75.796129,1,75.80,31.0
660,1363466,NaN,NaN,NaN,NaN,34.0,57.021471,1,57.02,34.0
661,1363490,NaN,NaN,NaN,NaN,12.0,2.853333,1,2.85,12.0
662,1363491,NaN,NaN,NaN,NaN,17.0,115.224118,1,115.22,17.0

In [152]:
trans_table=join_checking_credit_saving[['cust_id','no_of_accounts','all_tran_avg','no_of_trans']]
trans_table

     cust_id  no_of_accounts  all_tran_avg  no_of_trans
0    1362480               3        132.25        150.0
1    1362484               3        111.69        184.0
2    1362485               2        127.88        168.0
3    1362486               2         49.14         50.0
4    1362487               3         86.09        103.0
..       ...             ...           ...          ...
658  1363376               1        109.47         34.0
659  1363445               1         75.80         31.0
660  1363466               1         57.02         34.0
661  1363490               1          2.85         12.0
662  1363491               1        115.22         17.0

[663 rows x 4 columns]